package com.jessysnow.boot.utils;

import com.vladsch.flexmark.html.HtmlRenderer;
import com.vladsch.flexmark.parser.Parser;
import com.vladsch.flexmark.util.ast.Node;
import com.vladsch.flexmark.util.data.MutableDataSet;
import org.junit.Test;

import java.awt.desktop.SystemSleepEvent;

public class FlexMarkUtilTest {
    String markDown = "# **《都是撒谎惹的祸》剧本台词**\n" +
            "\n" +
            "　\t***德柏***：三。\n" +
            "\n" +
            "　　***肖旭***：四个五。\n" +
            "\n" +
            "　　***德柏***：你干啥?\n" +
            "\n" +
            "　　***张学恒***：炸。\n" +
            "\n" +
            "　　***德柏***：干啥，咋这么多炸呢你们。\n" +
            "\n" +
            "　　***肖旭***：炸。\n" +
            "\n" +
            "　　***张学恒***：炸。\n" +
            "\n" +
            "　　***肖旭***：炸。\n" +
            "\n" +
            "　　****张学恒***：炸。\n" +
            "\n" +
            "　　***肖旭***：炸。\n" +
            "\n" +
            "　　***张学恒***：炸，没了。\n" +
            "\n" +
            "　　***德柏***：你俩一伙的炸啥呀?\n" +
            "\n" +
            "　　***肖旭***：那咱赢了，赢了。\n" +
            "\n" +
            "　　***德柏***：你说你在我边上站着干吗呀?你一过来我就输。\n" +
            "\n" +
            "　　***源东***：我这不看着得劲吗。\n" +
            "\n" +
            "　　***德柏***：我这风水全让你挡没了。\n" +
            "\n" +
            "　　***肖旭***：这是你的。\n" +
            "\n" +
            "　　***源东***：你看我这不有用吗，给你捡个牌啥的。\n" +
            "\n" +
            "　　***肖旭***：好勒。\n" +
            "\n" +
            "　　***德柏***：这风水全没了。(电话铃响)等会儿啊，接电话。\n" +
            "\n" +
            "　　***源东***：我来。\n" +
            "\n" +
            "　　***德柏***：唉，媳妇。\n" +
            "\n" +
            "　　***媳妇***：德博你干啥呢?\n" +
            "\n" +
            "　　***德柏***：我没事，忙着呢。\n" +
            "\n" +
            "　　***媳妇***：你没事儿，你是不是打牌呢?\n" +
            "\n" +
            "　　***德柏***：没打牌。\n" +
            "\n" +
            "　　***媳妇***：你没打牌，你不回家，你干啥呢，你跟我说。\n" +
            "\n" +
            "　　***张学恒***：你快点慢死了。\n" +
            "\n" +
            "　　***德柏***：没有。\n" +
            "\n" +
            "　　***媳妇***：啥玩意死了。\n" +
            "\n" +
            "　　***德柏***：那个，源东死了。\n" +
            "\n" +
            "　　***媳妇***：啥?源东死了?不是他怎么就死了呢，咋回事啊，老公?\n" +
            "\n" +
            "　　***德柏***：媳妇我不跟你说了，死得可惨了，我不跟你说了，再见。\n" +
            "\n" +
            "　　***源东***：我咋死了呢，但没事啊，你玩吧，我这把一张牌没出，你玩吧。\n" +
            "\n" +
            "　　***张学恒***：出完了，玩吧。\n" +
            "\n" +
            "　　***肖旭***：我俩都赢了，都出完了都。\n" +
            "\n" +
            "　　***德柏***：干啥，完了。你说又怪你，你说你，哎呀。\n" +
            "\n" +
            "　　***肖旭***：没事，重新来过，来，这些是你的。\n" +
            "\n" +
            "　　***德柏***：别碰我的牌呀，我那个运气全都没了。\n" +
            "\n" +
            "　  *** 张学恒***：我这牌有点少啊。\n" +
            "\n" +
            "　   ***德柏***：(手机响)你等会啊，我媳妇来电话了，唉，媳妇。\n" +
            "\n" +
            "　　***媳妇***：老公，你在哪呢?我过去送送源东啦。\n" +
            "\n" +
            "　　***德柏***：哎呀，你别来了。来自我爱小宋网\n" +
            "\n" +
            "　　***媳妇***：不是，源东活着的时候我都没有好好照顾他，他来咱家连顿正经饭都没吃过，这人死了，我不得送送他呀。\n" +
            "\n" +
            "　　***德柏***：那个媳妇，别说了，真的不用，不用那什么，哎呀，不用，死了就死了，人死了就完了。\n" +
            "\n" +
            "　　***媳妇***：咋了，我为啥不能过来看啊?你在那哇啦哇啦干啥呢?我为啥不能过来看。\n" +
            "\n" +
            "　　***德柏***：你不用过来，一堆老爷们挺忙的，你就别过来了。\n" +
            "\n" +
            "　　***媳妇***：你是不是骗我呢?\n" +
            "\n" +
            "　　***德柏***：我没骗你。\n" +
            "\n" +
            "　　***媳妇***：你没骗我，你给我拍张照让我看看。\n" +
            "\n" +
            "　　***德柏***：我，我，我给你拍照片，等我。干啥呀，啥情况?\n" +
            "\n" +
            "　　***源东***：这把真赢了，这把我赢了，他俩没牌了，撇丢了，这把咱。\n" +
            "\n" +
            "　　***德柏***：人家没牌了赢啥?\n" +
            "\n" +
            "　　***张学恒***：我俩都出完了。\n" +
            "\n" +
            "　　***德柏***：听我说是这样啊，你嫂子现在是怀疑我那什么。\n" +
            "\n" +
            "　　***源东***：外面有人了。\n" +
            "\n" +
            "　　***德柏***：她不让我打牌，不是外面有人，为了咱们以后能更好的玩耍，配合我一下，源东，你一会你躺下行不行，咱拍一下这个灵堂那个感觉。\n" +
            "\n" +
            "　　~~***源东***：不是，那你得。~~\n" +
            "\n" +
            "　　***肖旭***：哪有灵堂这块?";
    @Test
    public void testOnParseMarkDown(){
        String html = FlexMarkUtil.parseMarkDown(markDown);
        System.out.println(html);
    }
}
